Repository: antonstamov/wfdb-java
Catalog: trunk/nativelibs/linuxi386/tmp/libidn-1.12/po/*.po
Languages: pl

source: Success
pl: Sukces

source: String preparation failed
pl: Przygotowanie ³añcucha nie powiod³o siê

source: Punycode failed
pl: Punycode zawiod³o

source: Non-digit/letter/hyphen in input
pl: Znak nie bêd±cy cyfr±, liter± ani kresk± na wej¶ciu

source: Forbidden leading or trailing minus sign (`-')
pl: Zabroniony wiod±cy lub koñcz±cy znak minus (`-')

source: Output would be too large or too small
pl: Wyj¶cie mo¿e byæ zbyt du¿e lub zbyt ma³e

source: Input does not start with ACE prefix (`xn--')
pl: Wej¶cie nie zaczyna siê przedrostkiem ACE (`xn--')

source: String not idempotent under ToASCII
pl: £añcuch nie idempotentny wzglêdem ToASCII

source: Input already contain ACE prefix (`xn--')
pl: Wej¶cie ju¿ zawiera przedrostek ACE (`xn--')

source: System iconv failed
pl: Systemowa funkcja iconv nie powiod³a siê

source: Cannot allocate memory
pl: Nie mo¿na przydzieliæ pamiêci

source: System dlopen failed
pl: Systemowa funkcja dlopen nie powiod³a siê

source: Unknown error
pl: Nieznany b³±d

source: String not idempotent under Unicode NFKC normalization
pl: £añcuch nie idempotentny wzglêdem normalizacji Unikodu NFKC

source: Invalid input
pl: B³êdne wej¶cie

source: Output would exceed the buffer space provided
pl: Wyj¶cie przekroczy³oby dostarczone miejsce w buforze

source: String size limit exceeded
pl: Przekroczony limit rozmiaru ³añcucha

source: Forbidden unassigned code points in input
pl: Zabronione nieprzypisane znaki na wej¶ciu

source: Prohibited code points in input
pl: Zabronione znaki na wej¶ciu

source: Conflicting bidirectional properties in input
pl: Konfliktowe w³asno¶ci dwukierunkowego pisma na wej¶ciu

source: Malformed bidirectional string
pl: ¬le sformu³owany ³añcuch dwukierunkowy

source: Prohibited bidirectional code points in input
pl: Zabronione znaki dwukierunkowe na wej¶ciu

source: Error in stringprep profile definition
pl: B³±d w definicji profilu stringprep

source: Flag conflict with profile
pl: Konflikt flag z profilem

source: Unknown profile
pl: Nieznany profil

source: Unicode normalization failed (internal error)
pl: Normalizacja Unikodu nie powiod³a siê (b³±d wewnêtrzny)

source: Code points prohibited by top-level domain
pl: Znaki zabronione przez domenê najwy¿szego poziomu

source: Missing input
pl: Brak wej¶cia

source: No top-level domain found in input
pl: Nie znaleziono domeny najwy¿szego poziomu na wej¶ciu

source: Report bugs to <%s>.
pl: Prosimy zg³aszaæ b³êdy na adres <%s>. B³êdy w t³umaczeniu prosimy zg³aszaæ na adres <translation-team-pl@lists.sourceforge.net>.

source: Try `%s --help' for more information.
pl: Polecenie `%s --help' pozwoli uzyskaæ wiêcej informacji.

source: Usage: %s [OPTION]... [STRINGS]...
pl: Sk³adnia: %s [OPCJA]... [£AÑCUCHY]...

source: Internationalized Domain Name (IDN) convert STRINGS, or standard input.
pl: Program konwertuje £AÑCUCHY lub standardowe wyj¶cie z kodowania w³a¶ciwego dla umiêdzynarodowionych nazw domen (IDN - Internationalized Domain Name).

source: Command line interface to the internationalized domain name library. All strings are expected to be encoded in the preferred charset used by your locale. Use `--debug' to find out what this charset is. You can override the charset used by setting environment variable CHARSET. To process a string that starts with `-', for example `-foo', use `--' to signal the end of parameters, as in `idn --quiet -a -- -foo'. Mandatory arguments to long options are mandatory for short options too.
pl: Jest to interfejs linii poleceñ do biblioteki umiêdzynarodowionych nazw domen. Wszystkie ³añcuchy powinny byæ zakodowane w zestawie znaków w³a¶ciwym dla u¿ywanej lokalizacji. Opcja `--debug' pozwoli okre¶liæ, jaki to jest zestaw znaków. Mo¿na wymusiæ u¿ywany zestaw znaków zmienn± ¶rodowiskow± CHARSET. Aby przetworzyæ ³añcuchy zaczynaj±ce siê od `-', np. `-foo', nale¿y u¿yæ `--', aby zasygnalizowaæ koniec parametrów, np. `idn --quiet -a -- -foo'. Argumenty obowi±zkowe dla d³ugich opcji s± równie¿ obowi±zkowe dla odpowiednich krótkich opcji.

source: -h, --help Print help and exit -V, --version Print version and exit
pl: -h, --help Wypisanie opisu i zakoñczenie -V, --version Wypisanie wersji i zakoñczenie

source: -s, --stringprep Prepare string according to nameprep profile -d, --punycode-decode Decode Punycode -e, --punycode-encode Encode Punycode -a, --idna-to-ascii Convert to ACE according to IDNA (default mode) -u, --idna-to-unicode Convert from ACE according to IDNA
pl: -s, --stringprep Przygotowanie ³añcucha zgodnie z profilem nameprep -d, --punycode-decode Dekodowanie Punycode -e, --punycode-encode Kodowanie Punycode -a, --idna-to-ascii Konwersja do ACE zgodnie z IDNA (tryb domy¶lny) -u, --idna-to-unicode Konwersja z ACE zgodnie z IDNA

source: -n, --nfkc Normalize string according to Unicode v3.2 NFKC
pl: -n, --nfkc Normalizacja ³añcucha zgodnie z Unicode v3.2 NFKC

source: -p, --profile=STRING Use specified stringprep profile instead Valid stringprep profiles: `Nameprep', `iSCSI', `Nodeprep', `Resourceprep', `trace', `SASLprep'
pl: -p, --profile=£AÑCUCH U¿ycie okre¶lonego profilu stringprep Poprawne profile stringprep: `Nameprep', `iSCSI', `Nodeprep', `Resourceprep', `trace', `SASLprep'

source: --debug Print debugging information --quiet Silent operation
pl: --debug Wypisywanie informacji diagnostycznych --quiet Dzia³enie po cichu

source: Only one of -s, -e, -d, -a, -u or -n can be specified.
pl: Mo¿na podaæ tylko jedno z -s, -e, -d, -a, -u lub -n.

source: Charset `%s'.
pl: Zestaw znaków `%s'.

source: Type each input string on a line by itself, terminated by a newline character.
pl: Nale¿y podaæ ka¿dy ³añcuch w osobnej linii, zakoñczony znakiem nowej linii.

source: Input error
pl: B³±d wej¶cia

source: Could not convert from %s to UTF-8.
pl: Nie mo¿na przekonwertowaæ z %s na UTF-8.

source: Could not convert from UTF-8 to UCS-4.
pl: Nie mo¿na przekonwertowaæ z UTF-8 na UCS-4.

source: Could not convert from UTF-8 to %s.
pl: Nie mo¿na przekonwertowaæ z UTF-8 na %s.

source: Could not convert from UCS-4 to UTF-8.
pl: Nie mo¿na przekonwertowaæ z UCS-4 na UTF-8.

source: tld_check_4z (position %lu): %s
pl: tld_check_4z (pozycja %lu): %s

source: Could not do NFKC normalization.
pl: Normalizacja NFKC nie powiod³a siê.
